--***************************************************************************
--                    “ипы двоичных данных в T-SQL
--***************************************************************************

------------------------------------ Binary ---------------------------------

-- “ипы двоичных данных Binary. 
-- ƒиапазон значений от 1 до 8000 байт. 

-- “ипы двоичных данных записываетс€ как Binary(n), 
-- где n - определ€ет максимальное количество байт(максимально n = 8000).

PRINT 'Binary'

DECLARE @binary Binary(1) = 16;
PRINT @binary;

----------------------------------- VarBinary -------------------------------

-- “ипы двоичных данных VarBinary. 
-- ƒиапазон значений от 1 до 2^31 байт. 

-- “ипы двоичных данных записываетс€ как VarBinary(n/max), 
-- где n - определ€ет максимальное количество байт(максимально n = 8000),
-- или же вместо n записываетс€ max то максимальное количество байт становитс€ 2^31.

PRINT 'VarBinary'

DECLARE @varBinary VarBinary(max) = 2147483647;
PRINT @varBinary;

-----------------------------------------------------------------------------